{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}plog_66
       {txt}log:  {res}/Users/macbookair/Desktop/OCP_NEER/Codes/exchange.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Dec 2020, 14:32:21
{txt}
{com}. *** Merge with exchange rate
. project, doinfo 
{txt}project master > Project Name: {res}master
{txt}project master > Project Dir.: {res}/Users/macbookair/Desktop/OCP_NEER
{txt}project master > Build start : {res}03dec2020, 14:31:17{txt}
project master > Do-file Name: {res}exchange.do
{txt}project master > Enclosing do-files:
project master >     {res}master.do
{txt}
{com}. local pdir "`r(pdir)'"
{txt}
{com}. local dofile "`(dofile)'"
{txt}
{com}. 
. cd "`pdir'/data_derived/merge"
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/merge
{txt}
{com}. project, uses("iso.dta")
{txt}project master > do-file uses: {res}"data_derived/merge/iso.dta" filesig(1911444758:12365){txt}

{com}. 
. cd "`pdir'/data_raw/exchange"
{res}/Users/macbookair/Desktop/OCP_NEER/data_raw/exchange
{txt}
{com}. * Importing the exchange rates 
. project, original("exchange_rate.xlsx")
{txt}project master > do-file uses original: {res}"data_raw/exchange/exchange_rate.xlsx" filesig(3723355476:655156){txt}

{com}. import excel "exchange_rate.xlsx",firstrow cellrange(B7) allstring clear
{res}{txt}
{com}. drop Scale BaseYear 
{txt}
{com}. foreach v of varlist _all {c -(}
{txt}  2{com}.    local x : variable label `v'
{txt}  3{com}.    rename `v' rate`x'
{txt}  4{com}. {c )-}
{res}{txt}
{com}. rename rateCountry Country
{res}{txt}
{com}. reshape long rate, i(Country) j(year) string 
{txt}(note: j = 2000 2000M01 2000M02 2000M03 2000M04 2000M05 2000M06 2000M07 2000M08 2000M09 2000M10 2000M11 2000M12 2000Q1 2000Q2 2000Q3 2000Q4 2001 2001M01 2001M02 2001M03 2001M04 2001M05 2001M06 2001M07 2001M08 2001M09 2001M10 2001M11 2001M12 2001Q1 2001Q2 2001Q3 2001Q4 2002 2002M01 2002M02 2002M03 2002M04 2002M05 2002M06 2002M07 2002M08 2002M09 2002M10 2002M11 2002M12 2002Q1 2002Q2 2002Q3 2002Q4 2003 2003M01 2003M02 2003M03 2003M04 2003M05 2003M06 2003M07 2003M08 2003M09 2003M10 2003M11 2003M12 2003Q1 2003Q2 2003Q3 2003Q4 2004 2004M01 2004M02 2004M03 2004M04 2004M05 2004M06 2004M07 2004M08 2004M09 2004M10 2004M11 2004M12 2004Q1 2004Q2 2004Q3 2004Q4 2005 2005M01 2005M02 2005M03 2005M04 2005M05 2005M06 2005M07 2005M08 2005M09 2005M10 2005M11 2005M12 2005Q1 2005Q2 2005Q3 2005Q4 2006 2006M01 2006M02 2006M03 2006M04 2006M05 2006M06 2006M07 2006M08 2006M09 2006M10 2006M11 2006M12 2006Q1 2006Q2 2006Q3 2006Q4 2007 2007M01 2007M02 2007M03 2007M04 2007M05 2007M06 2007M07 2007M08 2007M09 2007M10 2007M11 2007M12 2007Q1 2007Q2 2007Q3 2007Q4 2008 2008M01 2008M02 2008M03 2008M04 2008M05 2008M06 2008M07 2008M08 2008M09 2008M10 2008M11 2008M12 2008Q1 2008Q2 2008Q3 2008Q4 2009 2009M01 2009M02 2009M03 2009M04 2009M05 2009M06 2009M07 2009M08 2009M09 2009M10 2009M11 2009M12 2009Q1 2009Q2 2009Q3 2009Q4 2010 2010M01 2010M02 2010M03 2010M04 2010M05 2010M06 2010M07 2010M08 2010M09 2010M10 2010M11 2010M12 2010Q1 2010Q2 2010Q3 2010Q4 2011 2011M01 2011M02 2011M03 2011M04 2011M05 2011M06 2011M07 2011M08 2011M09 2011M10 2011M11 2011M12 2011Q1 2011Q2 2011Q3 2011Q4 2012 2012M01 2012M02 2012M03 2012M04 2012M05 2012M06 2012M07 2012M08 2012M09 2012M10 2012M11 2012M12 2012Q1 2012Q2 2012Q3 2012Q4 2013 2013M01 2013M02 2013M03 2013M04 2013M05 2013M06 2013M07 2013M08 2013M09 2013M10 2013M11 2013M12 2013Q1 2013Q2 2013Q3 2013Q4 2014 2014M01 2014M02 2014M03 2014M04 2014M05 2014M06 2014M07 2014M08 2014M09 2014M10 2014M11 2014M12 2014Q1 2014Q2 2014Q3 2014Q4 2015 2015M01 2015M02 2015M03 2015M04 2015M05 2015M06 2015M07 2015M08 2015M09 2015M10 2015M11 2015M12 2015Q1 2015Q2 2015Q3 2015Q4 2016 2016M01 2016M02 2016M03 2016M04 2016M05 2016M06 2016M07 2016M08 2016M09 2016M10 2016M11 2016M12 2016Q1 2016Q2 2016Q3 2016Q4 2017 2017M01 2017M02 2017M03 2017M04 2017M05 2017M06 2017M07 2017M08 2017M09 2017M10 2017M11 2017M12 2017Q1 2017Q2 2017Q3 2017Q4 2018 2018M01 2018M02 2018M03 2018M04 2018M05 2018M06 2018M07 2018M08 2018M09 2018M10 2018M11 2018M12 2018Q1 2018Q2 2018Q3 2018Q4 2019 2019M01 2019M02 2019M03 2019M04 2019M05 2019M06 2019M07 2019M08 2019M09 2019M10 2019M11 2019M12 2019Q1 2019Q2 2019Q3 2019Q4 2020 2020M01 2020M02 2020M03 2020M04 2020M05 2020M06 2020M07 2020M08 2020Q1 2020Q2 2020Q3)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     200   {txt}->{res}   70400
{txt}Number of variables            {res}     353   {txt}->{res}       3
{txt}j variable (352 values)                   ->   {res}year
{txt}xij variables:
    {res}rate2000 rate2000M01 ... rate2020Q3   {txt}->   {res}rate
{txt}{hline 77}

{com}. rename year period
{res}{txt}
{com}. 
. replace Country = "Hong Kong SAR" if Country == "China, P.R.: Hong Kong"
{txt}(352 real changes made)

{com}. replace Country = "Macao SAR" if Country == "China, P.R.: Macao"
{txt}(352 real changes made)

{com}. replace Country = "Congo dem" if Country == "Congo, Dem. Rep. of the"
{txt}(352 real changes made)

{com}. replace Country = "Guinea Bissau" if Country == "Guinea-Bissau" 
{txt}(352 real changes made)

{com}. 
. gen partner  = regexs(1) if regexm(Country, "([A-Za-z]+[ ]*[A-Za-z]+[ ]*[A-Za-z]+)[,]*[A-Za-z]*")
{txt}
{com}. 
. *** Cleansing country names 
. 
. * Matching country names
. replace partner = "China, Hong Kong SAR" if partner == "Hong Kong SAR"
{txt}(352 real changes made)

{com}. replace partner = "China, Macao SAR" if partner == "Macao SAR"
{txt}(352 real changes made)

{com}. replace partner = "Dem. Rep. of the Congo" if partner == "Congo dem"
{txt}(352 real changes made)

{com}. replace partner = "Guinea-Bissau" if partner == "Guinea Bissau"
{txt}(352 real changes made)

{com}. replace partner = "Bolivia (Plurinational State of)" if partner == "Bolivia"
{txt}variable {bf}partner{sf} was {bf}{res}str26{sf}{txt} now {bf}{res}str32{sf}
{txt}(352 real changes made)

{com}. replace partner = "Bosnia Herzegovina" if partner == "Bosnia and Herzegovina"
{txt}(352 real changes made)

{com}. replace partner = "Cayman Isds" if partner == "Cayman Islands"
{txt}(352 real changes made)

{com}. replace partner = "Central African Rep." if partner == "Central African Rep"
{txt}(352 real changes made)

{com}. replace partner = "Czechia" if partner == "Czech Rep"
{txt}(352 real changes made)

{com}. replace partner = "CuraÃ§ao" if partner == "Cura"
{txt}(704 real changes made)

{com}. replace partner = "Dominican Rep." if partner == "Dominican Rep"
{txt}(352 real changes made)

{com}. replace partner = "Faeroe Isds" if partner == "Faroe Islands"
{txt}(352 real changes made)

{com}. replace partner = "Saint Kitts and Nevis" if partner == "Kitts and Nevis"
{txt}(352 real changes made)

{com}. replace partner = "Rep. of Korea" if partner == "Korea"
{txt}(352 real changes made)

{com}. replace partner = "Kyrgyzstan" if partner == "Kyrgyz Rep"
{txt}(352 real changes made)

{com}. replace partner = "Lao People's Dem. Rep." if partner == "Lao People"
{txt}(352 real changes made)

{com}. replace partner = "Saint Lucia" if partner == "Lucia"
{txt}(352 real changes made)

{com}. replace partner = "FS Micronesia" if partner == "Micronesia"
{txt}(352 real changes made)

{com}. replace partner = "Rep. of Moldova" if partner == "Moldova"
{txt}(352 real changes made)

{com}. replace partner = "Saint Maarten" if partner == "Sint Maarten"
{txt}(352 real changes made)

{com}. replace partner = "Solomon Isds" if partner == "Solomon Islands"
{txt}(352 real changes made)

{com}. replace partner = "Syria" if partner == "Syrian Arab Rep"
{txt}(352 real changes made)

{com}. replace partner = "United Rep. of Tanzania" if partner == "Tanzania"
{txt}(352 real changes made)

{com}. replace partner = "Timor-Leste" if partner == "Timor"
{txt}(352 real changes made)

{com}. replace partner = "USA" if partner == "United States"
{txt}(352 real changes made)

{com}. replace partner = "Viet Nam" if partner == "Vietnam"
{txt}(352 real changes made)

{com}. replace partner = "Saint Vincent and the Grenadines" if partner == "Vincent and the"
{txt}(352 real changes made)

{com}. replace partner = "Sao Tome and Principe" if partner == "o Tom"
{txt}(352 real changes made)

{com}. replace partner = "C├┤te d'Ivoire" if partner == "te d"
{txt}(352 real changes made)

{com}. 
. cd "`pdir'/data_derived/merge"
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/merge
{txt}
{com}. merge m:1 partner using iso, gen(_merge_iso)
{res}{txt}{p 0 7 2}
(note: variable
partner was 
str32, now str38 to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           4,972
{txt}{col 9}from master{col 30}{res}           4,928{txt}  (_merge_iso==1)
{col 9}from using{col 30}{res}              44{txt}  (_merge_iso==2)

{col 5}matched{col 30}{res}          65,472{txt}  (_merge_iso==3)
{col 5}{hline 41}

{com}. tab partner if _merge_iso == 1

                               {txt}partner {c |}      Freq.     Percent        Cum.
{hline 39}{c +}{hline 35}
              Central African Economic {c |}{res}        352        7.14        7.14
{txt}                              CuraÃ§ao {c |}{res}        704       14.29       21.43
{txt}                        C├┤te d'Ivoire {c |}{res}        352        7.14       28.57
{txt}            Eastern Caribbean Currency {c |}{res}        352        7.14       35.71
{txt}                             Euro Area {c |}{res}        352        7.14       42.86
{txt}                              Guernsey {c |}{res}        352        7.14       50.00
{txt}                           Isle of Man {c |}{res}        352        7.14       57.14
{txt}                                Jersey {c |}{res}        352        7.14       64.29
{txt}                                Kosovo {c |}{res}        352        7.14       71.43
{txt}                  Netherlands Antilles {c |}{res}        352        7.14       78.57
{txt}                            Slovak Rep {c |}{res}        352        7.14       85.71
{txt}                    Taiwan Province of {c |}{res}        352        7.14       92.86
{txt}                 West African Economic {c |}{res}        352        7.14      100.00
{txt}{hline 39}{c +}{hline 35}
                                 Total {c |}{res}      4,928      100.00
{txt}
{com}. tab partner if _merge_iso == 2

                               {txt}partner {c |}      Freq.     Percent        Cum.
{hline 39}{c +}{hline 35}
                        American Samoa {c |}{res}          1        2.27        2.27
{txt}                               Andorra {c |}{res}          1        2.27        4.55
{txt}                               Austria {c |}{res}          1        2.27        6.82
{txt}                               Belgium {c |}{res}          1        2.27        9.09
{txt}                               Bonaire {c |}{res}          1        2.27       11.36
{txt}                       Br. Virgin Isds {c |}{res}          1        2.27       13.64
{txt}                        Christmas Isds {c |}{res}          1        2.27       15.91
{txt}                            Cocos Isds {c |}{res}          1        2.27       18.18
{txt}                             Cook Isds {c |}{res}          1        2.27       20.45
{txt}                                  Cuba {c |}{res}          1        2.27       22.73
{txt}                               Cura̤ao {c |}{res}          1        2.27       25.00
{txt}                         C̫te d'Ivoire {c |}{res}          1        2.27       27.27
{txt}           Dem. People's Rep. of Korea {c |}{res}          1        2.27       29.55
{txt}              Falkland Isds (Malvinas) {c |}{res}          1        2.27       31.82
{txt}                               Finland {c |}{res}          1        2.27       34.09
{txt}                             Fmr Sudan {c |}{res}          1        2.27       36.36
{txt}             Fr. South Antarctic Terr. {c |}{res}          1        2.27       38.64
{txt}                                France {c |}{res}          1        2.27       40.91
{txt}                               Germany {c |}{res}          1        2.27       43.18
{txt}                                  Guam {c |}{res}          1        2.27       45.45
{txt}                               Ireland {c |}{res}          1        2.27       47.73
{txt}                                 Italy {c |}{res}          1        2.27       50.00
{txt}                            Luxembourg {c |}{res}          1        2.27       52.27
{txt}                         Marshall Isds {c |}{res}          1        2.27       54.55
{txt}                               Mayotte {c |}{res}          1        2.27       56.82
{txt}                       N. Mariana Isds {c |}{res}          1        2.27       59.09
{txt}                        Neth. Antilles {c |}{res}          1        2.27       61.36
{txt}                           Netherlands {c |}{res}          1        2.27       63.64
{txt}                                  Niue {c |}{res}          1        2.27       65.91
{txt}                          Norfolk Isds {c |}{res}          1        2.27       68.18
{txt}                              Portugal {c |}{res}          1        2.27       70.45
{txt}                      Saint Barth̩lemy {c |}{res}          1        2.27       72.73
{txt}                          Saint Helena {c |}{res}          1        2.27       75.00
{txt}             Saint Pierre and Miquelon {c |}{res}          1        2.27       77.27
{txt}                 Serbia and Montenegro {c |}{res}          1        2.27       79.55
{txt}                              Slovakia {c |}{res}          1        2.27       81.82
{txt}                                 Spain {c |}{res}          1        2.27       84.09
{txt}                    State of Palestine {c |}{res}          1        2.27       86.36
{txt}                               Tokelau {c |}{res}          1        2.27       88.64
{txt}                 Turks and Caicos Isds {c |}{res}          1        2.27       90.91
{txt}                                Tuvalu {c |}{res}          1        2.27       93.18
{txt}  United States Minor Outlying Islands {c |}{res}          1        2.27       95.45
{txt}                Wallis and Futuna Isds {c |}{res}          1        2.27       97.73
{txt}                                 World {c |}{res}          1        2.27      100.00
{txt}{hline 39}{c +}{hline 35}
                                 Total {c |}{res}         44      100.00
{txt}
{com}. replace _merge_iso = 3 if partner == "Euro Area" 
{txt}(352 real changes made)

{com}. 
. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Austria" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Austria" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Belgium" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Belgium" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Cyprus" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Cyprus" if dup == 1
{txt}(352 real changes made)

{com}. drop dup
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Estonia" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Estonia" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Finland" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Finland" if dup == 1
{txt}(352 real changes made)

{com}. drop dup
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "France" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "France" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Germany" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Germany" if dup == 1
{txt}(352 real changes made)

{com}. drop dup
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Greece" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Greece" if dup == 1
{txt}(352 real changes made)

{com}. drop dup
{txt}
{com}.  expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Ireland" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Ireland" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Italy" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Italy" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Luxembourg" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Luxembourg" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Malta" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Malta" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Netherlands" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Netherlands" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Portugal" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Portugal" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Slovakia" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Slovakia" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Slovenia" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Slovenia" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. expand 2 if Country == "Euro Area", generate (dup)
{txt}(352 observations created)

{com}. replace partner = "Spain" if dup == 1 
{txt}(352 real changes made)

{com}. replace Country = "Spain" if dup == 1
{txt}(352 real changes made)

{com}. drop dup 
{txt}
{com}. 
. keep if _merge_iso == 3
{txt}(4,620 observations deleted)

{com}. 
. gen rate1 = real(rate)
{txt}(3,431 missing values generated)

{com}. drop rate
{txt}
{com}. rename rate1 rate
{res}{txt}
{com}. drop _merge_iso
{txt}
{com}. 
. cd "`pdir'/data_derived/exchange"
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/exchange
{txt}
{com}. save exchange, replace 
{txt}(note: file exchange.dta not found)
file exchange.dta saved

{com}. project, creates("exchange.dta") preserve
{txt}project master > do-file creates: {res}"data_derived/exchange/exchange.dta" filesig(307534504:7330190){txt}

{com}. 
. * Exchange rates by year 
. gen year = regexs(0) if regexm(period, "^([0-9][0-9][0-9][0-9])$")
{txt}(67,524 missing values generated)

{com}. //gen Quarter = regexs(1) if regexm(period, "[Q]([0-9])$")
. gen year1= real(year)
{txt}(67,524 missing values generated)

{com}. drop year
{txt}
{com}. rename year1 year
{res}{txt}
{com}. keep if year != . 
{txt}(67,524 observations deleted)

{com}. 
. ***Exchange_rate by year 
. levelsof year, local(levels)
{txt}2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020

{com}. foreach x of local levels {c -(} 
{txt}  2{com}.         gen rate_mar_`x' = rate if year == `x' & partnercode == 504
{txt}  3{com}.                         levelsof rate_mar_`x', local(F)
{txt}  4{com}.                         foreach f of local F {c -(}
{txt}  5{com}.                         replace rate_mar_`x' = `f' if rate_mar_`x' == . & year == `x'
{txt}  6{com}.                                 {c )-}
{txt}  7{com}. {c )-}
{txt}(4,283 missing values generated)
10.62563610076904
(203 real changes made)
(4,283 missing values generated)
11.30297470092773
(203 real changes made)
(4,283 missing values generated)
11.020583152771
(203 real changes made)
(4,283 missing values generated)
9.574383735656738
(203 real changes made)
(4,283 missing values generated)
8.868016242980957
(203 real changes made)
(4,283 missing values generated)
8.865008354187012
(203 real changes made)
(4,283 missing values generated)
8.795583724975586
(203 real changes made)
(4,283 missing values generated)
8.192333221435547
(203 real changes made)
(4,283 missing values generated)
7.750325202941895
(203 real changes made)
(4,283 missing values generated)
8.057100296020508
(203 real changes made)
(4,283 missing values generated)
8.417158126831055
(203 real changes made)
(4,283 missing values generated)
8.089875221252441
(203 real changes made)
(4,283 missing values generated)
8.628444671630859
(203 real changes made)
(4,283 missing values generated)
8.40550422668457
(203 real changes made)
(4,283 missing values generated)
8.406336784362793
(203 real changes made)
(4,283 missing values generated)
9.764348030090332
(203 real changes made)
(4,283 missing values generated)
9.807476043701172
(203 real changes made)
(4,283 missing values generated)
9.691997528076172
(203 real changes made)
(4,283 missing values generated)
9.386102676391602
(203 real changes made)
(4,283 missing values generated)
9.61707592010498
(203 real changes made)
(4,284 missing values generated)


{com}. 
. egen rate_mar = rowtotal(rate_mar_*)
{txt}
{com}. drop rate_mar_*
{txt}
{com}. drop if rate_mar == 0
{txt}(204 observations deleted)

{com}. gen exchange  = 1/(rate_mar/rate)
{txt}(168 missing values generated)

{com}. 
. keep partner year exchange 
{txt}
{com}. sort partner year 
{txt}
{com}. quietly by  partner year : gen dup = cond(_N==1,0,_n)
{txt}
{com}. drop if exchange ==.
{txt}(168 observations deleted)

{com}. collapse (min)  exchange  , by(partner year)
{txt}
{com}. 
. bysort partner : gen base = exchange if _n == 1
{txt}(3,678 missing values generated)

{com}. levelsof partner, local(P)
{txt}`"Afghanistan"' `"Albania"' `"Algeria"' `"Angola"' `"Anguilla"' `"Antigua and Barbuda"' `"Argentina"' `"Armenia"' `"Aruba"' `"Australia"' `"Austria"' `"Azerbaijan"' `"Bahamas"' `"Bahrain"' `"Bangladesh"' `"Barbados"' `"Belarus"' `"Belgium"' `"Belize"' `"Benin"' `"Bermuda"' `"Bhutan"' `"Bolivia (Plurinational State of)"' `"Bosnia Herzegovina"' `"Botswana"' `"Brazil"' `"Brunei Darussalam"' `"Bulgaria"' `"Burkina Faso"' `"Burundi"' `"Cabo Verde"' `"Cambodia"' `"Cameroon"' `"Canada"' `"Cayman Isds"' `"Central African Rep."' `"Chad"' `"Chile"' `"China"' `"China, Hong Kong SAR"' `"China, Macao SAR"' `"Colombia"' `"Comoros"' `"Congo"' `"Costa Rica"' `"Croatia"' `"Cyprus"' `"Czechia"' `"Dem. Rep. of the Congo"' `"Denmark"' `"Djibouti"' `"Dominica"' `"Dominican Rep."' `"Ecuador"' `"Egypt"' `"El Salvador"' `"Equatorial Guinea"' `"Eritrea"' `"Estonia"' `"Eswatini"' `"Ethiopia"' `"Euro Area"' `"FS Micronesia"' `"Faeroe Isds"' `"Fiji"' `"Finland"' `"France"' `"French Polynesia"' `"Gabon"' `"Gambia"' `"Georgia"' `"Germany"' `"Ghana"' `"Gibraltar"' `"Greece"' `"Greenland"' `"Grenada"' `"Guatemala"' `"Guinea"' `"Guinea-Bissau"' `"Guyana"' `"Haiti"' `"Honduras"' `"Hungary"' `"Iceland"' `"India"' `"Indonesia"' `"Iran"' `"Iraq"' `"Ireland"' `"Israel"' `"Italy"' `"Jamaica"' `"Japan"' `"Jordan"' `"Kazakhstan"' `"Kenya"' `"Kiribati"' `"Kuwait"' `"Kyrgyzstan"' `"Lao People's Dem. Rep."' `"Latvia"' `"Lebanon"' `"Lesotho"' `"Liberia"' `"Libya"' `"Lithuania"' `"Luxembourg"' `"Madagascar"' `"Malawi"' `"Malaysia"' `"Maldives"' `"Mali"' `"Malta"' `"Mauritania"' `"Mauritius"' `"Mexico"' `"Mongolia"' `"Montenegro"' `"Montserrat"' `"Morocco"' `"Mozambique"' `"Myanmar"' `"Namibia"' `"Nauru"' `"Nepal"' `"Netherlands"' `"New Caledonia"' `"New Zealand"' `"Nicaragua"' `"Niger"' `"Nigeria"' `"North Macedonia"' `"Norway"' `"Oman"' `"Pakistan"' `"Palau"' `"Panama"' `"Papua New Guinea"' `"Paraguay"' `"Peru"' `"Philippines"' `"Poland"' `"Portugal"' `"Qatar"' `"Rep. of Korea"' `"Rep. of Moldova"' `"Romania"' `"Russian Federation"' `"Rwanda"' `"Saint Kitts and Nevis"' `"Saint Lucia"' `"Saint Maarten"' `"Saint Vincent and the Grenadines"' `"Samoa"' `"San Marino"' `"Sao Tome and Principe"' `"Saudi Arabia"' `"Senegal"' `"Serbia"' `"Seychelles"' `"Sierra Leone"' `"Singapore"' `"Slovakia"' `"Slovenia"' `"Solomon Isds"' `"Somalia"' `"South Africa"' `"South Sudan"' `"Spain"' `"Sri Lanka"' `"Sudan"' `"Suriname"' `"Sweden"' `"Switzerland"' `"Syria"' `"Tajikistan"' `"Thailand"' `"Timor-Leste"' `"Togo"' `"Tonga"' `"Trinidad and Tobago"' `"Tunisia"' `"Turkey"' `"Turkmenistan"' `"USA"' `"Uganda"' `"Ukraine"' `"United Arab Emirates"' `"United Kingdom"' `"United Rep. of Tanzania"' `"Uruguay"' `"Uzbekistan"' `"Vanuatu"' `"Venezuela"' `"Viet Nam"' `"Yemen"' `"Zambia"' `"Zimbabwe"'

{com}. foreach p of local P {c -(}
{txt}  2{com}. levelsof base if partner == "`p'" , local(F)
{txt}  3{com}. foreach f of local F {c -(}
{txt}  4{com}. replace base = `f' if base == . & partner == "`p'"
{txt}  5{com}.         {c )-}
{txt}  6{com}. {c )-}
{txt}4.456916809082031
(19 real changes made)
13.52478218078613
(19 real changes made)
7.082849979400635
(19 real changes made)
.9449358582496643
(19 real changes made)
.2541024386882782
(19 real changes made)
.2541024386882782
(19 real changes made)
.0940649509429932
(19 real changes made)
50.77585983276367
(19 real changes made)
.1684605032205582
(19 real changes made)
.162326917052269
(19 real changes made)
.1018955633044243
(19 real changes made)
.0842143222689629
(19 real changes made)
.0941120162606239
(19 real changes made)
.0353861153125763
(19 real changes made)
4.907156944274902
(19 real changes made)
.1882240325212479
(19 real changes made)
.0082512702792883
(19 real changes made)
.1018955633044243
(19 real changes made)
.1882240325212479
(19 real changes made)
66.83909606933594
(19 real changes made)
.0941120162606239
(19 real changes made)
4.229544639587402
(19 real changes made)
.581945538520813
(19 real changes made)
.1997865736484528
(19 real changes made)
.4801822304725647
(19 real changes made)
.1721706837415695
(19 real changes made)
.1622456610202789
(19 real changes made)
.1998256891965866
(19 real changes made)
66.83909606933594
(19 real changes made)
67.82402038574219
(19 real changes made)
10.90537548065186
(19 real changes made)
361.4607238769531
(19 real changes made)
66.83909606933594
(19 real changes made)
.1397934257984161
(19 real changes made)
.0784263610839844
(19 real changes made)
66.83909606933594
(19 real changes made)
66.83909606933594
(19 real changes made)
50.78166961669922
(19 real changes made)
.7791067361831665
(19 real changes made)
.733242392539978
(19 real changes made)
.7553336024284363
(19 real changes made)
196.496826171875
(19 real changes made)
50.12932968139648
(19 real changes made)
66.83909606933594
(19 real changes made)
29.00406837463379
(19 real changes made)
.7790278196334839
(19 real changes made)
.0585761740803719
(19 real changes made)
3.632574558258057
(19 real changes made)
2.053367137908936
(19 real changes made)
.76072096824646
(19 real changes made)
16.72568130493164
(19 real changes made)
.2541024386882782
(19 real changes made)
1.52286958694458
(19 real changes made)
.0941120162606239
(19 real changes made)
.3267616033554077
(19 real changes made)
.8239507079124451
(19 real changes made)
66.83909606933594
(19 real changes made)
.9058281183242798
(19 real changes made)
.1018955633044243
(19 real changes made)
.6531212329864502
(19 real changes made)
.7733427286148071
(19 real changes made)
.1018955633044243
(19 real changes made)
.0941120162606239
(19 real changes made)
.76072096824646
(16 real changes made)
.2003291696310043
(19 real changes made)
.1018955633044243
(19 real changes made)
.1018955633044243
(19 real changes made)
12.15936946868896
(19 real changes made)
66.83909606933594
(19 real changes made)
1.203469157218933
(19 real changes made)
.1859810352325439
(19 real changes made)
.1018955633044243
(19 real changes made)
.0512834414839745
(19 real changes made)
.0622015297412872
(19 real changes made)
.1018955633044243
(19 real changes made)
.76072096824646
(16 real changes made)
.2541024386882782
(19 real changes made)
.7306065559387207
(19 real changes made)
164.4014434814453
(19 real changes made)
66.83909606933594
(19 real changes made)
17.16885375976563
(19 real changes made)
1.992413997650146
(19 real changes made)
1.396681070327759
(19 real changes made)
26.55644989013672
(19 real changes made)
7.398704528808594
(19 real changes made)
4.229544639587402
(19 real changes made)
792.5902099609375
(19 real changes made)
166.0941619873047
(19 real changes made)
188.4502258300781
(18 real changes made)
.1018955633044243
(19 real changes made)
.3837260603904724
(19 real changes made)
.1018955633044243
(19 real changes made)
4.045470714569092
(19 real changes made)
10.14202785491943
(19 real changes made)
.066725417971611
(19 real changes made)
13.37645435333252
(19 real changes made)
7.169034004211426
(19 real changes made)
.162326917052269
(19 real changes made)
.0288690086454153
(19 real changes made)
4.489503860473633
(19 real changes made)
742.322021484375
(19 real changes made)
.0570789389312267
(13 real changes made)
141.8738555908203
(19 real changes made)
.6531212329864502
(19 real changes made)
3.849416732788086
(19 real changes made)
.0482031963765621
(19 real changes made)
.3764480650424957
(14 real changes made)
.1018955633044243
(19 real changes made)
127.380256652832
(19 real changes made)
5.603787422180176
(19 real changes made)
.3576256334781647
(19 real changes made)
1.107698440551758
(19 real changes made)
66.83909606933594
(19 real changes made)
.0412351787090302
(19 real changes made)
2.248555660247803
(18 real changes made)
2.470398664474487
(19 real changes made)
.8898816704750061
(19 real changes made)
101.327262878418
(19 real changes made)
.1018955633044243
(19 real changes made)
.2541024386882782
(19 real changes made)
1
(19 real changes made)
1.433067202568054
(19 real changes made)
.6133021116256714
(19 real changes made)
.6531212329864502
(19 real changes made)
.162326917052269
(19 real changes made)
6.690780162811279
(19 real changes made)
.1018955633044243
(19 real changes made)
12.15936946868896
(19 real changes made)
.2071545869112015
(19 real changes made)
1.193753600120544
(19 real changes made)
66.83909606933594
(19 real changes made)
9.570940971374512
(19 real changes made)
6.202345848083496
(19 real changes made)
.828359067440033
(19 real changes made)
.0361860692501068
(19 real changes made)
5.048938751220703
(19 real changes made)
.1128030493855476
(14 real changes made)
.0941120162606239
(19 real changes made)
.2618343532085419
(19 real changes made)
328.1077270507813
(19 real changes made)
.3284509181976318
(19 real changes made)
4.159021377563477
(19 real changes made)
.4090178608894348
(19 real changes made)
.1018955633044243
(19 real changes made)
.3425677418708801
(19 real changes made)
106.4366912841797
(19 real changes made)
1.170209169387817
(19 real changes made)
.2043051272630692
(19 real changes made)
2.647292613983154
(19 real changes made)
36.67509460449219
(19 real changes made)
.2541024386882782
(19 real changes made)
.2541024386882782
(19 real changes made)
.2212642282247543
(8 real changes made)
.2541024386882782
(19 real changes made)
.3092860877513885
(19 real changes made)
.1018955633044243
(19 real changes made)
.7508417963981628
(19 real changes made)
.3529200553894043
(19 real changes made)
66.83909606933594
(19 real changes made)
5.9446702003479
(19 real changes made)
.5377388000488281
(19 real changes made)
196.8940887451172
(19 real changes made)
.1622456610202789
(19 real changes made)
.1018955633044243
(19 real changes made)
.1018955633044243
(19 real changes made)
.4789294898509979
(19 real changes made)
3916.90625
(8 real changes made)
.6531212329864502
(19 real changes made)
.3694680035114288
(8 real changes made)
.1018955633044243
(19 real changes made)
7.247106552124023
(19 real changes made)
.2419831603765488
(18 real changes made)
.1244622468948364
(19 real changes made)
.8622772097587585
(19 real changes made)
.1589403748512268
(19 real changes made)
1.056407332420349
(17 real changes made)
.1954000741243362
(19 real changes made)
3.775002717971802
(19 real changes made)
.0941120162606239
(19 real changes made)
66.83909606933594
(19 real changes made)
.1654962152242661
(19 real changes made)
.5928865075111389
(19 real changes made)
.1289977580308914
(19 real changes made)
.0588405728340149
(19 real changes made)
489.3824768066406
(1 real change made)
.0941120162606239
(19 real changes made)
154.7648773193359
(19 real changes made)
.5119913220405579
(19 real changes made)
.3456263542175293
(19 real changes made)
.0622015297412872
(19 real changes made)
75.32805633544922
(19 real changes made)
1.13871693611145
(19 real changes made)
22.26768684387207
(7 real changes made)
12.95389080047607
(19 real changes made)
.0639930367469788
(17 real changes made)
1333.35546875
(19 real changes made)
15.21963787078857
(19 real changes made)
.2927677929401398
(19 real changes made)
.0041850083507597
(8 real changes made)

{com}. replace exchange = (exchange/base)*100
{txt}(3,877 real changes made)

{com}. drop base
{txt}
{com}. 
. cd "`pdir'/data_derived/neer/year"
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer/year
{txt}
{com}. save exchange_year, replace 
{txt}(note: file exchange_year.dta not found)
file exchange_year.dta saved

{com}. project, creates("exchange_year.dta") 
{txt}project master > do-file creates: {res}"data_derived/neer/year/exchange_year.dta" filesig(512107591:182196){txt}

{com}. 
. ***Exchange_rate by Month
. cd "`pdir'/data_derived/exchange"
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/exchange
{txt}
{com}. use exchange, clear
{txt}
{com}. gen Month = regexr(period, "[M]","/")
{txt}
{com}. gen month = monthly(Month, "YM")
{txt}(4,284 missing values generated)

{com}. format month %tm
{txt}
{com}. replace month = . if regexm(Month, "[Q]")
{txt}(16,932 real changes made, 16,932 to missing)

{com}. drop if month == .
{txt}(21,216 observations deleted)

{com}. 
. levelsof month, local(levels)
{txt}480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726 727

{com}. foreach x of local levels {c -(} 
{txt}  2{com}.         gen rate_mar_`x' = rate if month == `x' & partnercode == 504
{txt}  3{com}.                         levelsof rate_mar_`x', local(F)
{txt}  4{com}.                         foreach f of local F {c -(}
{txt}  5{com}.                         replace rate_mar_`x' = `f' if rate_mar_`x' == . & month == `x'
{txt}  6{com}.                                 {c )-}
{txt}  7{com}. {c )-}
{txt}(50,591 missing values generated)
10.05063247680664
(203 real changes made)
(50,591 missing values generated)
10.25247573852539
(203 real changes made)
(50,591 missing values generated)
10.34886360168457
(203 real changes made)
(50,591 missing values generated)
10.44672203063965
(203 real changes made)
(50,591 missing values generated)
10.72673034667969
(203 real changes made)
(50,591 missing values generated)
10.44684982299805
(203 real changes made)
(50,591 missing values generated)
10.51650047302246
(203 real changes made)
(50,591 missing values generated)
10.74337959289551
(203 real changes made)
(50,591 missing values generated)
10.96292972564697
(203 real changes made)
(50,591 missing values generated)
11.0787296295166
(203 real changes made)
(50,591 missing values generated)
11.09169960021973
(203 real changes made)
(50,591 missing values generated)
10.84212017059326
(203 real changes made)
(50,591 missing values generated)
10.59000015258789
(203 real changes made)
(50,591 missing values generated)
10.6939001083374
(203 real changes made)
(50,591 missing values generated)
10.80910015106201
(203 real changes made)
(50,591 missing values generated)
11.0403003692627
(203 real changes made)
(50,591 missing values generated)
11.66549968719482
(203 real changes made)
(50,591 missing values generated)
11.88080024719238
(203 real changes made)
(50,591 missing values generated)
11.81330013275146
(203 real changes made)
(50,591 missing values generated)
11.42399978637695
(203 real changes made)
(50,591 missing values generated)
11.31779956817627
(203 real changes made)
(50,591 missing values generated)
11.35900020599365
(203 real changes made)
(50,591 missing values generated)
11.53499984741211
(203 real changes made)
(50,591 missing values generated)
11.50699996948242
(203 real changes made)
(50,591 missing values generated)
11.58399963378906
(203 real changes made)
(50,591 missing values generated)
11.71199989318848
(203 real changes made)
(50,591 missing values generated)
11.64999961853027
(203 real changes made)
(50,591 missing values generated)
11.54599952697754
(203 real changes made)
(50,591 missing values generated)
11.25300025939941
(203 real changes made)
(50,591 missing values generated)
10.9060001373291
(203 real changes made)
(50,591 missing values generated)
10.5930004119873
(203 real changes made)
(50,591 missing values generated)
10.72299957275391
(203 real changes made)
(50,591 missing values generated)
10.69099998474121
(203 real changes made)
(50,591 missing values generated)
10.69099998474121
(203 real changes made)
(50,591 missing values generated)
10.52099990844727
(203 real changes made)
(50,591 missing values generated)
10.3769998550415
(203 real changes made)
(50,591 missing values generated)
10.05099964141846
(203 real changes made)
(50,591 missing values generated)
9.939299583435059
(203 real changes made)
(50,591 missing values generated)
9.917300224304199
(203 real changes made)
(50,591 missing values generated)
9.882800102233887
(203 real changes made)
(50,591 missing values generated)
9.375
(203 real changes made)
(50,591 missing values generated)
9.329899787902832
(203 real changes made)
(50,591 missing values generated)
9.524800300598145
(203 real changes made)
(50,591 missing values generated)
9.680800437927246
(203 real changes made)
(50,591 missing values generated)
9.622400283813477
(203 real changes made)
(50,591 missing values generated)
9.303299903869629
(203 real changes made)
(50,591 missing values generated)
9.313899993896484
(203 real changes made)
(50,591 missing values generated)
8.952099800109863
(203 real changes made)
(50,591 missing values generated)
8.754199981689453
(203 real changes made)
(50,591 missing values generated)
8.735400199890137
(203 real changes made)
(50,591 missing values generated)
8.95989990234375
(203 real changes made)
(50,591 missing values generated)
9.132399559020996
(203 real changes made)
(50,591 missing values generated)
9.112799644470215
(203 real changes made)
(50,591 missing values generated)
9.030900001525879
(203 real changes made)
(50,591 missing values generated)
8.952699661254883
(203 real changes made)
(50,591 missing values generated)
9.018899917602539
(203 real changes made)
(50,591 missing values generated)
8.993399620056152
(203 real changes made)
(50,591 missing values generated)
8.831899642944336
(203 real changes made)
(50,591 missing values generated)
8.556099891662598
(203 real changes made)
(50,591 missing values generated)
8.337599754333496
(203 real changes made)
(50,591 missing values generated)
8.477800369262695
(203 real changes made)
(50,591 missing values generated)
8.53600025177002
(203 real changes made)
(50,591 missing values generated)
8.440899848937988
(203 real changes made)
(50,591 missing values generated)
8.591899871826172
(203 real changes made)
(50,591 missing values generated)
8.723799705505371
(203 real changes made)
(50,591 missing values generated)
9.028400421142578
(203 real changes made)
(50,591 missing values generated)
9.100199699401855
(203 real changes made)
(50,591 missing values generated)
8.947299957275391
(203 real changes made)
(50,591 missing values generated)
8.968000411987305
(203 real changes made)
(50,591 missing values generated)
9.110600471496582
(203 real changes made)
(50,591 missing values generated)
9.246500015258789
(203 real changes made)
(50,591 missing values generated)
9.208700180053711
(203 real changes made)
(50,591 missing values generated)
9.055700302124023
(203 real changes made)
(50,591 missing values generated)
9.159600257873535
(203 real changes made)
(50,591 missing values generated)
9.108099937438965
(203 real changes made)
(50,591 missing values generated)
8.946900367736816
(203 real changes made)
(50,591 missing values generated)
8.67039966583252
(203 real changes made)
(50,591 missing values generated)
8.736499786376953
(203 real changes made)
(50,591 missing values generated)
8.72029972076416
(203 real changes made)
(50,591 missing values generated)
8.64680004119873
(203 real changes made)
(50,591 missing values generated)
8.69849967956543
(203 real changes made)
(50,591 missing values generated)
8.758199691772461
(203 real changes made)
(50,591 missing values generated)
8.608799934387207
(203 real changes made)
(50,591 missing values generated)
8.437199592590332
(203 real changes made)
(50,591 missing values generated)
8.55210018157959
(203 real changes made)
(50,591 missing values generated)
8.508600234985352
(203 real changes made)
(50,591 missing values generated)
8.423000335693359
(203 real changes made)
(50,591 missing values generated)
8.279999732971191
(203 real changes made)
(50,591 missing values generated)
8.284299850463867
(203 real changes made)
(50,591 missing values generated)
8.32960033416748
(203 real changes made)
(50,591 missing values generated)
8.178600311279297
(203 real changes made)
(50,591 missing values generated)
8.219099998474121
(203 real changes made)
(50,591 missing values generated)
8.092900276184082
(203 real changes made)
(50,591 missing values generated)
7.935800075531006
(203 real changes made)
(50,591 missing values generated)
7.728899955749512
(203 real changes made)
(50,591 missing values generated)
7.775100231170654
(203 real changes made)
(50,591 missing values generated)
7.717599868774414
(203 real changes made)
(50,591 missing values generated)
7.707300186157227
(203 real changes made)
(50,591 missing values generated)
7.375800132751465
(203 real changes made)
(50,591 missing values generated)
7.29069995880127
(203 real changes made)
(50,591 missing values generated)
7.367899894714355
(203 real changes made)
(50,591 missing values generated)
7.367899894714355
(203 real changes made)
(50,591 missing values generated)
7.280099868774414
(203 real changes made)
(50,591 missing values generated)
7.600100040435791
(203 real changes made)
(50,591 missing values generated)
7.873899936676025
(203 real changes made)
(50,591 missing values generated)
8.427300453186035
(203 real changes made)
(50,591 missing values generated)
8.686599731445313
(203 real changes made)
(50,591 missing values generated)
8.308699607849121
(203 real changes made)
(50,591 missing values generated)
8.413599967956543
(203 real changes made)
(50,591 missing values generated)
8.664299964904785
(203 real changes made)
(50,591 missing values generated)
8.51039981842041
(203 real changes made)
(50,591 missing values generated)
8.444700241088867
(203 real changes made)
(50,591 missing values generated)
8.204700469970703
(203 real changes made)
(50,591 missing values generated)
8.035900115966797
(203 real changes made)
(50,591 missing values generated)
7.654300212860107
(203 real changes made)
(50,591 missing values generated)
7.921000003814697
(203 real changes made)
(50,591 missing values generated)
7.769700050354004
(203 real changes made)
(50,591 missing values generated)
7.672599792480469
(203 real changes made)
(50,591 missing values generated)
7.629899978637695
(203 real changes made)
(50,591 missing values generated)
7.764100074768066
(203 real changes made)
(50,591 missing values generated)
7.91949987411499
(203 real changes made)
(50,591 missing values generated)
8.19950008392334
(203 real changes made)
(50,591 missing values generated)
8.252200126647949
(203 real changes made)
(50,591 missing values generated)
8.333000183105469
(203 real changes made)
(50,591 missing values generated)
8.796199798583984
(203 real changes made)
(50,591 missing values generated)
8.995200157165527
(203 real changes made)
(50,591 missing values generated)
8.677599906921387
(203 real changes made)
(50,591 missing values generated)
8.599599838256836
(203 real changes made)
(50,591 missing values generated)
8.502799987792969
(203 real changes made)
(50,591 missing values generated)
8.092700004577637
(203 real changes made)
(50,591 missing values generated)
8.20359992980957
(203 real changes made)
(50,591 missing values generated)
8.434000015258789
(203 real changes made)
(50,591 missing values generated)
8.347499847412109
(203 real changes made)
(50,591 missing values generated)
8.211299896240234
(203 real changes made)
(50,591 missing values generated)
8.042300224304199
(203 real changes made)
(50,591 missing values generated)
7.83620023727417
(203 real changes made)
(50,591 missing values generated)
7.885900020599365
(203 real changes made)
(50,591 missing values generated)
7.863699913024902
(203 real changes made)
(50,591 missing values generated)
7.914899826049805
(203 real changes made)
(50,591 missing values generated)
7.88700008392334
(203 real changes made)
(50,591 missing values generated)
8.170700073242188
(203 real changes made)
(50,591 missing values generated)
8.184100151062012
(203 real changes made)
(50,591 missing values generated)
8.273300170898438
(203 real changes made)
(50,591 missing values generated)
8.461600303649902
(203 real changes made)
(50,591 missing values generated)
8.601300239562988
(203 real changes made)
(50,591 missing values generated)
8.42609977722168
(203 real changes made)
(50,591 missing values generated)
8.442600250244141
(203 real changes made)
(50,591 missing values generated)
8.466899871826172
(203 real changes made)
(50,591 missing values generated)
8.666199684143066
(203 real changes made)
(50,591 missing values generated)
8.807000160217285
(203 real changes made)
(50,591 missing values generated)
8.948466300964355
(203 real changes made)
(50,591 missing values generated)
8.880970001220703
(203 real changes made)
(50,591 missing values generated)
8.622665405273438
(203 real changes made)
(50,591 missing values generated)
8.560199737548828
(203 real changes made)
(50,591 missing values generated)
8.638400077819824
(203 real changes made)
(50,591 missing values generated)
8.480533599853516
(203 real changes made)
(50,591 missing values generated)
8.401457786560059
(203 real changes made)
(50,591 missing values generated)
8.363710403442383
(203 real changes made)
(50,591 missing values generated)
8.573986053466797
(203 real changes made)
(50,591 missing values generated)
8.540859222412109
(203 real changes made)
(50,591 missing values generated)
8.559849739074707
(203 real changes made)
(50,591 missing values generated)
8.452960014343262
(203 real changes made)
(50,591 missing values generated)
8.514736175537109
(203 real changes made)
(50,591 missing values generated)
8.392167091369629
(203 real changes made)
(50,591 missing values generated)
8.365666389465332
(203 real changes made)
(50,591 missing values generated)
8.218230247497559
(203 real changes made)
(50,591 missing values generated)
8.294439315795898
(203 real changes made)
(50,591 missing values generated)
8.187985420227051
(203 real changes made)
(50,591 missing values generated)
8.232535362243652
(203 real changes made)
(50,591 missing values generated)
8.208395004272461
(203 real changes made)
(50,591 missing values generated)
8.126628875732422
(203 real changes made)
(50,591 missing values generated)
8.132872581481934
(203 real changes made)
(50,591 missing values generated)
8.175485610961914
(203 real changes made)
(50,591 missing values generated)
8.242056846618652
(203 real changes made)
(50,591 missing values generated)
8.258560180664063
(203 real changes made)
(50,591 missing values generated)
8.380433082580566
(203 real changes made)
(50,591 missing values generated)
8.617681503295898
(203 real changes made)
(50,591 missing values generated)
8.726386070251465
(203 real changes made)
(50,591 missing values generated)
8.843561172485352
(203 real changes made)
(50,591 missing values generated)
8.931443214416504
(203 real changes made)
(50,591 missing values generated)
9.367230415344238
(203 real changes made)
(50,591 missing values generated)
9.53617000579834
(203 real changes made)
(50,591 missing values generated)
9.899204254150391
(203 real changes made)
(50,591 missing values generated)
9.932209014892578
(203 real changes made)
(50,591 missing values generated)
9.758945465087891
(203 real changes made)
(50,591 missing values generated)
9.729772567749023
(203 real changes made)
(50,591 missing values generated)
9.835504531860352
(203 real changes made)
(50,591 missing values generated)
9.774572372436523
(203 real changes made)
(50,591 missing values generated)
9.723369598388672
(203 real changes made)
(50,591 missing values generated)
9.719414710998535
(203 real changes made)
(50,591 missing values generated)
9.991110801696777
(203 real changes made)
(50,591 missing values generated)
9.90467643737793
(203 real changes made)
(50,591 missing values generated)
9.922616004943848
(203 real changes made)
(50,591 missing values generated)
9.79322338104248
(203 real changes made)
(50,591 missing values generated)
9.779887199401855
(203 real changes made)
(50,591 missing values generated)
9.654749870300293
(203 real changes made)
(50,591 missing values generated)
9.675200462341309
(203 real changes made)
(50,591 missing values generated)
9.715322494506836
(203 real changes made)
(50,591 missing values generated)
9.804499626159668
(203 real changes made)
(50,591 missing values generated)
9.725128173828125
(203 real changes made)
(50,591 missing values generated)
9.729550361633301
(203 real changes made)
(50,591 missing values generated)
9.833385467529297
(203 real changes made)
(50,591 missing values generated)
9.950809478759766
(203 real changes made)
(50,591 missing values generated)
10.10534000396729
(203 real changes made)
(50,591 missing values generated)
10.05406856536865
(203 real changes made)
(50,591 missing values generated)
10.04092979431152
(203 real changes made)
(50,591 missing values generated)
10.0143871307373
(203 real changes made)
(50,591 missing values generated)
10.00028991699219
(203 real changes made)
(50,591 missing values generated)
9.816630363464355
(203 real changes made)
(50,591 missing values generated)
9.719510078430176
(203 real changes made)
(50,591 missing values generated)
9.567209243774414
(203 real changes made)
(50,591 missing values generated)
9.419909477233887
(203 real changes made)
(50,591 missing values generated)
9.366495132446289
(203 real changes made)
(50,591 missing values generated)
9.445773124694824
(203 real changes made)
(50,591 missing values generated)
9.450761795043945
(203 real changes made)
(50,591 missing values generated)
9.408011436462402
(203 real changes made)
(50,591 missing values generated)
9.240252494812012
(203 real changes made)
(50,591 missing values generated)
9.190074920654297
(203 real changes made)
(50,591 missing values generated)
9.183736801147461
(203 real changes made)
(50,591 missing values generated)
9.211585998535156
(203 real changes made)
(50,591 missing values generated)
9.424495697021484
(203 real changes made)
(50,591 missing values generated)
9.495320320129395
(203 real changes made)
(50,591 missing values generated)
9.46570873260498
(203 real changes made)
(50,591 missing values generated)
9.474550247192383
(203 real changes made)
(50,591 missing values generated)
9.410394668579102
(203 real changes made)
(50,591 missing values generated)
9.489800453186035
(203 real changes made)
(50,591 missing values generated)
9.518847465515137
(203 real changes made)
(50,591 missing values generated)
9.528463363647461
(203 real changes made)
(50,591 missing values generated)
9.535733222961426
(203 real changes made)
(50,591 missing values generated)
9.536370277404785
(203 real changes made)
(50,591 missing values generated)
9.610443115234375
(203 real changes made)
(50,591 missing values generated)
9.632495880126953
(203 real changes made)
(50,591 missing values generated)
9.679177284240723
(203 real changes made)
(50,591 missing values generated)
9.599699974060059
(203 real changes made)
(50,591 missing values generated)
9.590978622436523
(203 real changes made)
(50,591 missing values generated)
9.599347114562988
(203 real changes made)
(50,591 missing values generated)
9.688690185546875
(203 real changes made)
(50,591 missing values generated)
9.657795906066895
(203 real changes made)
(50,591 missing values generated)
9.650755882263184
(203 real changes made)
(50,591 missing values generated)
9.623427391052246
(203 real changes made)
(50,591 missing values generated)
9.609513282775879
(203 real changes made)
(50,591 missing values generated)
9.680600166320801
(203 real changes made)
(50,591 missing values generated)
9.684100151062012
(203 real changes made)
(50,591 missing values generated)
10.12932300567627
(203 real changes made)
(50,591 missing values generated)
9.85289478302002
(203 real changes made)
(50,591 missing values generated)
9.680468559265137
(203 real changes made)
(50,591 missing values generated)
9.563271522521973
(203 real changes made)
(50,592 missing values generated)


{com}. 
. egen rate_mar = rowtotal(rate_mar_*)
{txt}
{com}. drop rate_mar_*
{txt}
{com}. drop if rate_mar == 0
{txt}(204 observations deleted)

{com}. gen exchange  = rate/rate_mar
{txt}(2,102 missing values generated)

{com}. drop if exchange == .
{txt}(2,102 observations deleted)

{com}. keep partner month exchange 
{txt}
{com}. drop if partner == "Morocco"
{txt}(247 observations deleted)

{com}. 
. 
. sort partner month
{txt}
{com}. bysort partner : gen base = exchange if _n==1
{txt}(47,841 missing values generated)

{com}. levelsof partner, local(P)
{txt}`"Afghanistan"' `"Albania"' `"Algeria"' `"Angola"' `"Anguilla"' `"Antigua and Barbuda"' `"Argentina"' `"Armenia"' `"Aruba"' `"Australia"' `"Austria"' `"Azerbaijan"' `"Bahamas"' `"Bahrain"' `"Bangladesh"' `"Barbados"' `"Belarus"' `"Belgium"' `"Belize"' `"Benin"' `"Bermuda"' `"Bhutan"' `"Bolivia (Plurinational State of)"' `"Bosnia Herzegovina"' `"Botswana"' `"Brazil"' `"Brunei Darussalam"' `"Bulgaria"' `"Burkina Faso"' `"Burundi"' `"Cabo Verde"' `"Cambodia"' `"Cameroon"' `"Canada"' `"Cayman Isds"' `"Central African Rep."' `"Chad"' `"Chile"' `"China"' `"China, Hong Kong SAR"' `"China, Macao SAR"' `"Colombia"' `"Comoros"' `"Congo"' `"Costa Rica"' `"Croatia"' `"Cyprus"' `"Czechia"' `"Dem. Rep. of the Congo"' `"Denmark"' `"Djibouti"' `"Dominica"' `"Dominican Rep."' `"Ecuador"' `"Egypt"' `"El Salvador"' `"Equatorial Guinea"' `"Eritrea"' `"Estonia"' `"Eswatini"' `"Ethiopia"' `"Euro Area"' `"FS Micronesia"' `"Faeroe Isds"' `"Fiji"' `"Finland"' `"France"' `"French Polynesia"' `"Gabon"' `"Gambia"' `"Georgia"' `"Germany"' `"Ghana"' `"Gibraltar"' `"Greece"' `"Greenland"' `"Grenada"' `"Guatemala"' `"Guinea"' `"Guinea-Bissau"' `"Guyana"' `"Haiti"' `"Honduras"' `"Hungary"' `"Iceland"' `"India"' `"Indonesia"' `"Iran"' `"Iraq"' `"Ireland"' `"Israel"' `"Italy"' `"Jamaica"' `"Japan"' `"Jordan"' `"Kazakhstan"' `"Kenya"' `"Kiribati"' `"Kuwait"' `"Kyrgyzstan"' `"Lao People's Dem. Rep."' `"Latvia"' `"Lebanon"' `"Lesotho"' `"Liberia"' `"Libya"' `"Lithuania"' `"Luxembourg"' `"Madagascar"' `"Malawi"' `"Malaysia"' `"Maldives"' `"Mali"' `"Malta"' `"Mauritania"' `"Mauritius"' `"Mexico"' `"Mongolia"' `"Montenegro"' `"Montserrat"' `"Mozambique"' `"Myanmar"' `"Namibia"' `"Nauru"' `"Nepal"' `"Netherlands"' `"New Caledonia"' `"New Zealand"' `"Nicaragua"' `"Niger"' `"Nigeria"' `"North Macedonia"' `"Norway"' `"Oman"' `"Pakistan"' `"Palau"' `"Panama"' `"Papua New Guinea"' `"Paraguay"' `"Peru"' `"Philippines"' `"Poland"' `"Portugal"' `"Qatar"' `"Rep. of Korea"' `"Rep. of Moldova"' `"Romania"' `"Russian Federation"' `"Rwanda"' `"Saint Kitts and Nevis"' `"Saint Lucia"' `"Saint Maarten"' `"Saint Vincent and the Grenadines"' `"Samoa"' `"San Marino"' `"Sao Tome and Principe"' `"Saudi Arabia"' `"Senegal"' `"Serbia"' `"Seychelles"' `"Sierra Leone"' `"Singapore"' `"Slovakia"' `"Slovenia"' `"Solomon Isds"' `"Somalia"' `"South Africa"' `"South Sudan"' `"Spain"' `"Sri Lanka"' `"Sudan"' `"Suriname"' `"Sweden"' `"Switzerland"' `"Syria"' `"Tajikistan"' `"Thailand"' `"Timor-Leste"' `"Togo"' `"Tonga"' `"Trinidad and Tobago"' `"Tunisia"' `"Turkey"' `"Turkmenistan"' `"USA"' `"Uganda"' `"Ukraine"' `"United Arab Emirates"' `"United Kingdom"' `"United Rep. of Tanzania"' `"Uruguay"' `"Uzbekistan"' `"Vanuatu"' `"Venezuela"' `"Viet Nam"' `"Yemen"' `"Zambia"' `"Zimbabwe"'

{com}. foreach p of local P {c -(}
{txt}  2{com}. levelsof base if partner == "`p'" , local(F)
{txt}  3{com}. foreach f of local F {c -(}
{txt}  4{com}. replace base = `f' if base == . & partner == "`p'"
{txt}  5{com}.         {c )-}
{txt}  6{com}. {c )-}
{txt}4.656005382537842
(246 real changes made)
13.59357166290283
(246 real changes made)
6.869766712188721
(246 real changes made)
.5743956565856934
(246 real changes made)
.2686398029327393
(246 real changes made)
.2686398029327393
(246 real changes made)
.0994464755058289
(246 real changes made)
52.43650436401367
(246 real changes made)
.1780982464551926
(246 real changes made)
.1512939631938934
(246 real changes made)
.0981520116329193
(246 real changes made)
.0871984884142876
(246 real changes made)
.0994962230324745
(246 real changes made)
.0374105796217918
(246 real changes made)
5.074307441711426
(246 real changes made)
.198992446064949
(246 real changes made)
.0056812348775566
(246 real changes made)
.0981520116329193
(246 real changes made)
.198992446064949
(246 real changes made)
64.38349914550781
(246 real changes made)
.0994962230324745
(246 real changes made)
4.333249568939209
(246 real changes made)
.5976240634918213
(246 real changes made)
.1920153945684433
(246 real changes made)
.4594835340976715
(246 real changes made)
.1793841123580933
(246 real changes made)
.1664820611476898
(246 real changes made)
.1919779628515244
(246 real changes made)
64.38349914550781
(246 real changes made)
62.36323547363281
(246 real changes made)
10.6331615447998
(246 real changes made)
376.6927185058594
(245 real changes made)
64.38349914550781
(246 real changes made)
.1441630721092224
(246 real changes made)
.0829131901264191
(246 real changes made)
64.38349914550781
(246 real changes made)
64.38349914550781
(246 real changes made)
51.78281021118164
(246 real changes made)
.8237541317939758
(246 real changes made)
.7738816142082214
(246 real changes made)
.797143816947937
(246 real changes made)
191.5930328369141
(246 real changes made)
48.28762435913086
(246 real changes made)
64.38349914550781
(246 real changes made)
29.75235557556152
(246 real changes made)
.7547070384025574
(246 real changes made)
.0981520116329193
(342 real changes made)
3.527141332626343
(246 real changes made)
.5890176892280579
(246 real changes made)
.7298874258995056
(246 real changes made)
17.68256759643555
(246 real changes made)
.2686398029327393
(246 real changes made)
1.58974027633667
(246 real changes made)
.0994962230324745
(246 real changes made)
.3387846350669861
(245 real changes made)
.8710894584655762
(246 real changes made)
64.38349914550781
(246 real changes made)
.955163836479187
(246 real changes made)
1.533933281898499
(378 real changes made)
.6093537211418152
(246 real changes made)
.8096903562545776
(241 real changes made)
.0981520116329193
(246 real changes made)
.0994962230324745
(246 real changes made)
.7298874258995056
(210 real changes made)
.195549875497818
(246 real changes made)
.0981520116329193
(246 real changes made)
.0981520116329193
(246 real changes made)
11.712646484375
(246 real changes made)
64.38349914550781
(246 real changes made)
1.15800666809082
(246 real changes made)
.2016987502574921
(246 real changes made)
.0981520116329193
(246 real changes made)
.0358286388218403
(246 real changes made)
.0606150925159454
(246 real changes made)
.0981520116329193
(258 real changes made)
.7298874258995056
(210 real changes made)
.2686398029327393
(246 real changes made)
.7843207716941833
(246 real changes made)
178.5604095458984
(239 real changes made)
64.38349914550781
(246 real changes made)
18.00881767272949
(246 real changes made)
1.844421148300171
(246 real changes made)
1.446903944015503
(246 real changes made)
24.98847579956055
(246 real changes made)
7.173677921295166
(246 real changes made)
4.333249568939209
(246 real changes made)
724.213134765625
(246 real changes made)
174.6480560302734
(246 real changes made)
199.2317352294922
(239 real changes made)
.0981520116329193
(246 real changes made)
.4084320068359375
(246 real changes made)
.0981520116329193
(246 real changes made)
4.13911247253418
(246 real changes made)
10.46328449249268
(246 real changes made)
.0705428197979927
(246 real changes made)
13.83196544647217
(246 real changes made)
7.032453060150146
(246 real changes made)
.1512939631938934
(246 real changes made)
.0302804838865995
(246 real changes made)
4.600237846374512
(246 real changes made)
749.2782592773438
(246 real changes made)
.0580063015222549
(167 real changes made)
149.9905548095703
(246 real changes made)
.6093537211418152
(246 real changes made)
3.905226945877075
(245 real changes made)
.0460300967097282
(244 real changes made)
.3979848921298981
(179 real changes made)
.0981520116329193
(246 real changes made)
131.2112426757813
(245 real changes made)
4.627131462097168
(244 real changes made)
.3780856430530548
(246 real changes made)
1.171070575714111
(246 real changes made)
64.38349914550781
(246 real changes made)
.0407137349247932
(342 real changes made)
2.225332498550415
(238 real changes made)
2.535631418228149
(246 real changes made)
.943154513835907
(246 real changes made)
107.4837875366211
(246 real changes made)
.0981520116329193
(246 real changes made)
.2686398029327393
(246 real changes made)
1.33384644985199
(246 real changes made)
.6234930753707886
(245 real changes made)
.6093537211418152
(246 real changes made)
.1512939631938934
(246 real changes made)
6.821959018707275
(246 real changes made)
.0981520116329193
(246 real changes made)
11.712646484375
(246 real changes made)
.1935281306505203
(246 real changes made)
1.228778481483459
(246 real changes made)
64.38349914550781
(246 real changes made)
9.799432754516602
(245 real changes made)
5.947158336639404
(246 real changes made)
.7972542643547058
(246 real changes made)
.038256298750639
(246 real changes made)
5.152810573577881
(246 real changes made)
.1179551258683205
(186 real changes made)
.0994962230324745
(246 real changes made)
.2832229733467102
(246 real changes made)
331.5214233398438
(246 real changes made)
.3484357893466949
(244 real changes made)
4.02233362197876
(246 real changes made)
.4082927107810974
(246 real changes made)
.0981520116329193
(246 real changes made)
.3621662855148315
(246 real changes made)
112.4625701904297
(246 real changes made)
1.207963824272156
(246 real changes made)
.1825934946537018
(246 real changes made)
2.804709196090698
(246 real changes made)
34.77693557739258
(246 real changes made)
.2686398029327393
(246 real changes made)
.2686398029327393
(246 real changes made)
.2211869955062866
(117 real changes made)
.2686398029327393
(246 real changes made)
.3030650019645691
(246 real changes made)
.0981520116329193
(246 real changes made)
.7308236956596375
(245 real changes made)
.3731108605861664
(246 real changes made)
64.38349914550781
(246 real changes made)
5.825973033905029
(235 real changes made)
.5316481590270996
(246 real changes made)
231.3008575439453
(244 real changes made)
.1664820611476898
(246 real changes made)
.0981520116329193
(246 real changes made)
.0981520116329193
(332 real changes made)
.5048906207084656
(243 real changes made)
3775.43505859375
(113 real changes made)
.6093537211418152
(246 real changes made)
.3520448803901672
(108 real changes made)
.0981520116329193
(246 real changes made)
7.241991996765137
(246 real changes made)
.2561032772064209
(237 real changes made)
.0982525497674942
(246 real changes made)
.8440324664115906
(246 real changes made)
.1579801142215729
(246 real changes made)
1.11684513092041
(224 real changes made)
.1485478729009628
(245 real changes made)
3.710214376449585
(246 real changes made)
.0994962230324745
(246 real changes made)
64.38349914550781
(246 real changes made)
.1599532067775726
(246 real changes made)
.6267894506454468
(246 real changes made)
.1239225491881371
(241 real changes made)
.0542835518717766
(246 real changes made)
517.38037109375
(23 real changes made)
.0994962230324745
(246 real changes made)
151.8064575195313
(246 real changes made)
.5353991389274597
(246 real changes made)
.3653998672962189
(246 real changes made)
.0606150925159454
(246 real changes made)
79.48753356933594
(246 real changes made)
1.159728050231934
(246 real changes made)
14.03891849517822
(104 real changes made)
12.76735687255859
(245 real changes made)
.0648914352059364
(221 real changes made)
1397.026489257813
(245 real changes made)
15.96715354919434
(246 real changes made)
.2640510201454163
(246 real changes made)
.0038003576919436
(120 real changes made)

{com}. 
. replace exchange = (exchange/base)*100
{txt}(48,039 real changes made)

{com}. drop base
{txt}
{com}. sort partner month 
{txt}
{com}. quietly by  partner month : gen dup = cond(_N==1,0,_n)
{txt}
{com}. drop if dup > 0
{txt}(844 observations deleted)

{com}. ///collapse (min)  exchange  , by(partner month)
> drop dup 
{txt}
{com}. 
. winsor2 exchange, replace cuts(1,99)
{txt}
{com}. cd "`pdir'/data_derived/neer/month"
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer/month
{txt}
{com}. save exchange_month, replace 
{txt}file exchange_month.dta saved

{com}. project, creates("exchange_month.dta")
{txt}project master > do-file creates: {res}"data_derived/neer/month/exchange_month.dta" filesig(2703195860:2174824){txt}

{com}. 
{txt}end of do-file
      name:  {res}plog_66
       {txt}log:  {res}/Users/macbookair/Desktop/OCP_NEER/Codes/exchange.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Dec 2020, 14:32:48
{txt}{.-}
{smcl}
{txt}{sf}{ul off}