{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}plog_52
       {txt}log:  {res}/Users/macbookair/Desktop/OCP_NEER/Codes/merge_trade_ifa.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Dec 2020, 14:31:36
{txt}
{com}. *--------------------------------Start of do file------------------------------- 
. 
. project, doinfo 
{txt}project master > Project Name: {res}master
{txt}project master > Project Dir.: {res}/Users/macbookair/Desktop/OCP_NEER
{txt}project master > Build start : {res}03dec2020, 14:31:17{txt}
project master > Do-file Name: {res}merge_trade_ifa.do
{txt}project master > Enclosing do-files:
project master >     {res}master.do
{txt}
{com}. local pdir "`r(pdir)'"
{txt}
{com}. local dofile "`(dofile)'"
{txt}
{com}. 
. 
. * Merge aggregation level 1
. cd "`pdir'/data_derived/merge"
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/merge
{txt}
{com}. project, uses ("IFA.dta")
{txt}project master > do-file uses: {res}"data_derived/merge/IFA.dta" filesig(4151783626:1315905){txt}

{com}. use IFA, clear 
{txt}
{com}. merge 1:m year product partnercode using trade2 , gen(_merge_trade)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          14,371
{txt}{col 9}from master{col 30}{res}           3,265{txt}  (_merge_trade==1)
{col 9}from using{col 30}{res}          11,106{txt}  (_merge_trade==2)

{col 5}matched{col 30}{res}          51,837{txt}  (_merge_trade==3)
{col 5}{hline 41}

{com}. keep if _merge_trade == 3
{txt}(14,371 observations deleted)

{com}. drop _merge_trade
{txt}
{com}. sort reporter year product 
{txt}
{com}. 
. * generate id variable for year product sample
. egen t_p_group = group(year product) 
{txt}
{com}. replace trade = trade/1000 
{txt}(51,820 real changes made)

{com}. replace quantity = quantity/1000 // quantities in comtrade are expressed in kg 
{txt}(51,476 real changes made)

{com}. replace Imports = Imports*1000 // qties in ifa are expressed in 1000 tones
{txt}(38,146 real changes made)

{com}. replace Exports = Exports*1000 // idem 
{txt}(7,090 real changes made)

{com}. replace Production = Production*1000 // idem 
{txt}(13,502 real changes made)

{com}. replace Homedeliveries = Homedeliveries*1000
{txt}(13,261 real changes made)

{com}. replace ApparentConsumption = ApparentConsumption*1000
{txt}(39,767 real changes made)

{com}. drop if Imports == 0 & trade > 0
{txt}(13,686 observations deleted)

{com}. save ifa-trade2, replace 
{txt}(note: file ifa-trade2.dta not found)
file ifa-trade2.dta saved

{com}. project, creates("ifa-trade2.dta")
{txt}project master > do-file creates: {res}"data_derived/merge/ifa-trade2.dta" filesig(2126931814:5734290){txt}

{com}. 
. 
. * Merge aggregation level 2
. project, uses("IFA_agg1.dta")
{txt}project master > do-file uses: {res}"data_derived/merge/IFA_agg1.dta" filesig(609577950:792407){txt}

{com}. use IFA_agg1, clear 
{txt}
{com}. merge 1:m year product partnercode using trade2_agg1 , gen(_merge_trade)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          10,015
{txt}{col 9}from master{col 30}{res}           1,496{txt}  (_merge_trade==1)
{col 9}from using{col 30}{res}           8,519{txt}  (_merge_trade==2)

{col 5}matched{col 30}{res}          43,420{txt}  (_merge_trade==3)
{col 5}{hline 41}

{com}. keep if _merge_trade == 3
{txt}(10,015 observations deleted)

{com}. drop _merge_trade
{txt}
{com}. sort reporter year product 
{txt}
{com}. 
. * generate id variable for year product sample
. egen t_p_group = group(year product) 
{txt}
{com}. replace trade = trade/1000 
{txt}(43,406 real changes made)

{com}. replace quantity = quantity/1000 // quantities in comtrade are expressed in kg 
{txt}(43,124 real changes made)

{com}. replace Imports = Imports*1000 // qties in ifa are expressed in 1000 tones
{txt}(34,490 real changes made)

{com}. replace Exports = Exports*1000 // idem 
{txt}(7,725 real changes made)

{com}. replace Production = Production*1000 // idem 
{txt}(14,096 real changes made)

{com}. replace Homedeliveries = Homedeliveries*1000
{txt}(13,935 real changes made)

{com}. replace ApparentConsumption = ApparentConsumption*1000
{txt}(35,676 real changes made)

{com}. drop if Imports == 0 & trade > 0
{txt}(8,927 observations deleted)

{com}. save ifa-trade2_agg1, replace 
{txt}(note: file ifa-trade2_agg1.dta not found)
file ifa-trade2_agg1.dta saved

{com}. project, creates("ifa-trade2_agg1.dta")
{txt}project master > do-file creates: {res}"data_derived/merge/ifa-trade2_agg1.dta" filesig(3340780658:5185590){txt}

{com}. 
. * Merge aggregation level 3
. project, uses("IFA_agg2.dta")
{txt}project master > do-file uses: {res}"data_derived/merge/IFA_agg2.dta" filesig(3311375232:268909){txt}

{com}. use IFA_agg2, clear 
{txt}
{com}. merge 1:m year product partnercode using trade2_agg2 , gen(_merge_trade)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           5,032
{txt}{col 9}from master{col 30}{res}             145{txt}  (_merge_trade==1)
{col 9}from using{col 30}{res}           4,887{txt}  (_merge_trade==2)

{col 5}matched{col 30}{res}          29,808{txt}  (_merge_trade==3)
{col 5}{hline 41}

{com}. keep if _merge_trade == 3
{txt}(5,032 observations deleted)

{com}. drop _merge_trade
{txt}
{com}. sort reporter year product 
{txt}
{com}. 
. * generate id variable for year product sample
. egen t_p_group = group(year product) 
{txt}
{com}. replace trade = trade/1000 
{txt}(29,798 real changes made)

{com}. replace quantity = quantity/1000 // quantities in comtrade are expressed in kg 
{txt}(29,675 real changes made)

{com}. replace Imports = Imports*1000 // qties in ifa are expressed in 1000 tones
{txt}(26,919 real changes made)

{com}. replace Exports = Exports*1000 // idem 
{txt}(8,850 real changes made)

{com}. replace Production = Production*1000 // idem 
{txt}(12,372 real changes made)

{com}. replace Homedeliveries = Homedeliveries*1000
{txt}(12,169 real changes made)

{com}. replace ApparentConsumption = ApparentConsumption*1000
{txt}(27,070 real changes made)

{com}. drop if Imports == 0 & trade > 0
{txt}(2,888 observations deleted)

{com}. save ifa-trade2_agg2, replace 
{txt}(note: file ifa-trade2_agg2.dta not found)
file ifa-trade2_agg2.dta saved

{com}. project, creates("ifa-trade2_agg2.dta")
{txt}project master > do-file creates: {res}"data_derived/merge/ifa-trade2_agg2.dta" filesig(826742925:4049640){txt}

{com}. 
. *--------------------------------End of do file------------------------------- 
. 
{txt}end of do-file
      name:  {res}plog_52
       {txt}log:  {res}/Users/macbookair/Desktop/OCP_NEER/Codes/merge_trade_ifa.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Dec 2020, 14:31:37
{txt}{.-}
{smcl}
{txt}{sf}{ul off}