{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}plog_77
       {txt}log:  {res}/Users/macbookair/Desktop/OCP_NEER/Codes/neer_month.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Dec 2020, 14:32:49
{txt}
{com}. *--------------------------------Start of do file------------------------------- 
. 
. project, doinfo 
{txt}project master > Project Name: {res}master
{txt}project master > Project Dir.: {res}/Users/macbookair/Desktop/OCP_NEER
{txt}project master > Build start : {res}03dec2020, 14:31:17{txt}
project master > Do-file Name: {res}neer_month.do
{txt}project master > Enclosing do-files:
project master >     {res}master.do
{txt}
{com}. local pdir "`r(pdir)'"
{txt}
{com}. local dofile "`(dofile)'"
{txt}
{com}. 
. project, uses("`pdir'/data_derived/neer/weights_agg1.dta")
{txt}project master > do-file uses: {res}"data_derived/neer/weights_agg1.dta" filesig(107992850:287792){txt}

{com}. project, uses("`pdir'/data_derived/neer/weights_agg2.dta")
{txt}project master > do-file uses: {res}"data_derived/neer/weights_agg2.dta" filesig(2880480489:130824){txt}

{com}. project, uses("`pdir'/data_derived/neer/weights.dta")
{txt}project master > do-file uses: {res}"data_derived/neer/weights.dta" filesig(658233709:417152){txt}

{com}. project, uses("`pdir'/data_derived/neer/month/exchange_month.dta")
{txt}project master > do-file uses: {res}"data_derived/neer/month/exchange_month.dta" filesig(2703195860:2174824){txt}

{com}. 
. *** Merge with weights months 
. cd "`pdir'/data_derived/neer"
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer
{txt}
{com}. local myfiles : dir . files "weights*.dta"
{txt}
{com}. foreach file of local myfiles {c -(} 
{txt}  2{com}. use `file', clear
{txt}  3{com}. expand 12, gen(dup)
{txt}  4{com}. drop dup 
{txt}  5{com}. sort partner year product
{txt}  6{com}. quietly by partner  year product : gen dup = cond(_N==1,0,_n)
{txt}  7{com}. egen month = concat(year dup), punct("m")
{txt}  8{com}. drop dup 
{txt}  9{com}. gen Month = monthly(month, "YM")
{txt} 10{com}. format Month %tm
{txt} 11{com}. drop month 
{txt} 12{com}. rename Month month
{txt} 13{com}. save month_`file', replace 
{txt} 14{com}. 
. cd "`pdir'/data_derived/neer/month"
{txt} 15{com}. use exchange_month , clear 
{txt} 16{com}. cd "`pdir'/data_derived/neer"
{txt} 17{com}. merge 1:m partner month using  month_`file' , gen(_merge_rate) force
{txt} 18{com}. keep if _merge_rate == 3
{txt} 19{com}. drop _merge_rate 
{txt} 20{com}. 
. *** Compute the NEER 
. egen group = group(month product)
{txt} 21{com}. bysort group : gen pdct = exchange^double_weights
{txt} 22{com}. bysort group : gen neer = pdct[1]
{txt} 23{com}. bysort group : replace neer = neer[_n-1] * pdct if _n > 1
{txt} 24{com}. bysort group : replace neer = neer[_N]
{txt} 25{com}. 
. cd "`pdir'/data_derived/neer/month"
{txt} 26{com}. save neer_month_`file', replace
{txt} 27{com}. cd "`pdir'/data_derived/neer"
{txt} 28{com}. {c )-}
{txt}(81,037 observations created)
{res}{txt}(note: file month_weights.dta not found)
file month_weights.dta saved
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer/month
/Users/macbookair/Desktop/OCP_NEER/data_derived/neer

{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          25,269
{txt}{col 9}from master{col 30}{res}          22,456{txt}  (_merge_rate==1)
{col 9}from using{col 30}{res}           2,813{txt}  (_merge_rate==2)

{col 5}matched{col 30}{res}          85,591{txt}  (_merge_rate==3)
{col 5}{hline 41}
(25,269 observations deleted)
(83124 real changes made)
(83381 real changes made)
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer/month
{txt}file neer_month_weights.dta saved
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer
{txt}(55,627 observations created)
{res}{txt}(note: file month_weights_agg1.dta not found)
file month_weights_agg1.dta saved
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer/month
/Users/macbookair/Desktop/OCP_NEER/data_derived/neer

{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          24,113
{txt}{col 9}from master{col 30}{res}          21,883{txt}  (_merge_rate==1)
{col 9}from using{col 30}{res}           2,230{txt}  (_merge_rate==2)

{col 5}matched{col 30}{res}          58,454{txt}  (_merge_rate==3)
{col 5}{hline 41}
(24,113 observations deleted)
(57309 real changes made)
(57388 real changes made)
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer/month
{txt}file neer_month_weights_agg1.dta saved
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer
{txt}(24,794 observations created)
{res}{txt}(note: file month_weights_agg2.dta not found)
file month_weights_agg2.dta saved
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer/month
/Users/macbookair/Desktop/OCP_NEER/data_derived/neer

{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          22,875
{txt}{col 9}from master{col 30}{res}          21,511{txt}  (_merge_rate==1)
{col 9}from using{col 30}{res}           1,364{txt}  (_merge_rate==2)

{col 5}matched{col 30}{res}          25,684{txt}  (_merge_rate==3)
{col 5}{hline 41}
(22,875 observations deleted)
(25365 real changes made)
(25351 real changes made)
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer/month
{txt}file neer_month_weights_agg2.dta saved
{res}/Users/macbookair/Desktop/OCP_NEER/data_derived/neer
{txt}
{com}. 
. project, creates("`pdir'/data_derived/neer/month/neer_month_weights_agg1.dta")
{txt}project master > do-file creates: {res}"data_derived/neer/month/neer_month_weights_agg1.dta" filesig(2370503907:4451683){txt}

{com}. project, creates("`pdir'/data_derived/neer/month/neer_month_weights_agg2.dta")
{txt}project master > do-file creates: {res}"data_derived/neer/month/neer_month_weights_agg2.dta" filesig(2856109680:1961163){txt}

{com}. project, creates("`pdir'/data_derived/neer/month/neer_month_weights.dta")
{txt}project master > do-file creates: {res}"data_derived/neer/month/neer_month_weights.dta" filesig(2895962743:6514095){txt}

{com}. 
{txt}end of do-file
      name:  {res}plog_77
       {txt}log:  {res}/Users/macbookair/Desktop/OCP_NEER/Codes/neer_month.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Dec 2020, 14:32:51
{txt}{.-}
{smcl}
{txt}{sf}{ul off}